Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP256MU204.h
#define _RPOR0_RP35R0_POSITION                   0x00000008
#define _RPOR0_RP35R0_MASK                       0x00000100
#define _RPOR0_RP35R0_LENGTH                     0x00000001

#define _RPOR0_RP35R1_POSITION                   0x00000009
#define _RPOR0_RP35R1_MASK                       0x00000200
#define _RPOR0_RP35R1_LENGTH                     0x00000001

#define _RPOR0_RP35R2_POSITION                   0x0000000A
#define _RPOR0_RP35R2_MASK                       0x00000400
#define _RPOR0_RP35R2_LENGTH                     0x00000001

#define _RPOR0_RP35R3_POSITION                   0x0000000B
#define _RPOR0_RP35R3_MASK                       0x00000800
#define _RPOR0_RP35R3_LENGTH                     0x00000001

#define _RPOR0_RP35R4_POSITION                   0x0000000C
#define _RPOR0_RP35R4_MASK                       0x00001000
#define _RPOR0_RP35R4_LENGTH                     0x00000001

#define _RPOR0_RP35R5_POSITION                   0x0000000D
#define _RPOR0_RP35R5_MASK                       0x00002000
#define _RPOR0_RP35R5_LENGTH                     0x00000001

#define _RPOR1_RP36R_POSITION                    0x00000000
#define _RPOR1_RP36R_MASK                        0x0000003F
#define _RPOR1_RP36R_LENGTH                      0x00000006

#define _RPOR1_RP37R_POSITION                    0x00000008
#define _RPOR1_RP37R_MASK                        0x00003F00
#define _RPOR1_RP37R_LENGTH                      0x00000006

#define _RPOR1_RP36R0_POSITION                   0x00000000
#define _RPOR1_RP36R0_MASK                       0x00000001
#define _RPOR1_RP36R0_LENGTH                     0x00000001

#define _RPOR1_RP36R1_POSITION                   0x00000001
#define _RPOR1_RP36R1_MASK                       0x00000002
#define _RPOR1_RP36R1_LENGTH                     0x00000001

#define _RPOR1_RP36R2_POSITION                   0x00000002
#define _RPOR1_RP36R2_MASK                       0x00000004
#define _RPOR1_RP36R2_LENGTH                     0x00000001

#define _RPOR1_RP36R3_POSITION                   0x00000003
#define _RPOR1_RP36R3_MASK                       0x00000008
#define _RPOR1_RP36R3_LENGTH                     0x00000001

#define _RPOR1_RP36R4_POSITION                   0x00000004
#define _RPOR1_RP36R4_MASK                       0x00000010
#define _RPOR1_RP36R4_LENGTH                     0x00000001

#define _RPOR1_RP36R5_POSITION                   0x00000005
#define _RPOR1_RP36R5_MASK                       0x00000020
#define _RPOR1_RP36R5_LENGTH                     0x00000001

#define _RPOR1_RP37R0_POSITION                   0x00000008
#define _RPOR1_RP37R0_MASK                       0x00000100
#define _RPOR1_RP37R0_LENGTH                     0x00000001

#define _RPOR1_RP37R1_POSITION                   0x00000009
#define _RPOR1_RP37R1_MASK                       0x00000200
#define _RPOR1_RP37R1_LENGTH                     0x00000001

#define _RPOR1_RP37R2_POSITION                   0x0000000A
#define _RPOR1_RP37R2_MASK                       0x00000400
#define _RPOR1_RP37R2_LENGTH                     0x00000001

#define _RPOR1_RP37R3_POSITION                   0x0000000B
#define _RPOR1_RP37R3_MASK                       0x00000800
#define _RPOR1_RP37R3_LENGTH                     0x00000001

#define _RPOR1_RP37R4_POSITION                   0x0000000C
#define _RPOR1_RP37R4_MASK                       0x00001000
#define _RPOR1_RP37R4_LENGTH                     0x00000001

#define _RPOR1_RP37R5_POSITION                   0x0000000D
#define _RPOR1_RP37R5_MASK                       0x00002000
#define _RPOR1_RP37R5_LENGTH                     0x00000001

#define _RPOR2_RP38R_POSITION                    0x00000000
#define _RPOR2_RP38R_MASK                        0x0000003F
#define _RPOR2_RP38R_LENGTH                      0x00000006

#define _RPOR2_RP39R_POSITION                    0x00000008
#define _RPOR2_RP39R_MASK                        0x00003F00
#define _RPOR2_RP39R_LENGTH                      0x00000006

#define _RPOR2_RP38R0_POSITION                   0x00000000
#define _RPOR2_RP38R0_MASK                       0x00000001
#define _RPOR2_RP38R0_LENGTH                     0x00000001

#define _RPOR2_RP38R1_POSITION                   0x00000001
#define _RPOR2_RP38R1_MASK                       0x00000002
#define _RPOR2_RP38R1_LENGTH                     0x00000001

#define _RPOR2_RP38R2_POSITION                   0x00000002
#define _RPOR2_RP38R2_MASK                       0x00000004
#define _RPOR2_RP38R2_LENGTH                     0x00000001

#define _RPOR2_RP38R3_POSITION                   0x00000003
#define _RPOR2_RP38R3_MASK                       0x00000008
#define _RPOR2_RP38R3_LENGTH                     0x00000001

#define _RPOR2_RP38R4_POSITION                   0x00000004
#define _RPOR2_RP38R4_MASK                       0x00000010
#define _RPOR2_RP38R4_LENGTH                     0x00000001

#define _RPOR2_RP38R5_POSITION                   0x00000005
#define _RPOR2_RP38R5_MASK                       0x00000020
#define _RPOR2_RP38R5_LENGTH                     0x00000001

#define _RPOR2_RP39R0_POSITION                   0x00000008
#define _RPOR2_RP39R0_MASK                       0x00000100
#define _RPOR2_RP39R0_LENGTH                     0x00000001

#define _RPOR2_RP39R1_POSITION                   0x00000009
#define _RPOR2_RP39R1_MASK                       0x00000200
#define _RPOR2_RP39R1_LENGTH                     0x00000001

#define _RPOR2_RP39R2_POSITION                   0x0000000A
#define _RPOR2_RP39R2_MASK                       0x00000400
#define _RPOR2_RP39R2_LENGTH                     0x00000001

#define _RPOR2_RP39R3_POSITION                   0x0000000B
#define _RPOR2_RP39R3_MASK                       0x00000800
#define _RPOR2_RP39R3_LENGTH                     0x00000001

#define _RPOR2_RP39R4_POSITION                   0x0000000C
#define _RPOR2_RP39R4_MASK                       0x00001000
#define _RPOR2_RP39R4_LENGTH                     0x00000001

#define _RPOR2_RP39R5_POSITION                   0x0000000D
#define _RPOR2_RP39R5_MASK                       0x00002000
#define _RPOR2_RP39R5_LENGTH                     0x00000001

#define _RPOR3_RP40R_POSITION                    0x00000000
#define _RPOR3_RP40R_MASK                        0x0000003F
#define _RPOR3_RP40R_LENGTH                      0x00000006

